KCX-Mapping-Convert/data/kids/in/EMCSDeclaration_after.xml

<?xml version="1.0" encoding="UTF-8"?>
  <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
  <Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true">
  <To>FR01.CSFALT.2144</To>
  <From>FR01.CSFALT.2144</From>
  <MessageID>KA-20110916</MessageID>
  <SentAt>2011-09-18 10:24:20 +0200</SentAt>
  <Act>inform</Act>
  <Method>EMB</Method>
  <MessageVersion>2.0</MessageVersion>
  <MessageType>EMCSDeclaration</MessageType>
  </Header>
  </soap:Header>
  <soap:Body>
  <Submit xmlns="http://www.eurtradenet.com/schemas/uids/emcs/body/200911">
  <EMCS>
  <EMCSDeclaration>
  <LocalReferenceNumber>KA-20110919-03</LocalReferenceNumber>
  <Attributes>
  <SubmissionMessageType>SubmissionMessageType1</SubmissionMessageType>
  <DeferredSubmissionFlag>DeferredSubmissionFlag1</DeferredSubmissionFlag>
  </Attributes>
  <ConsignorTrader>
  <CustomerID>CustomerID3</CustomerID>
  <ExciseTaxNumber>ExciseTaxNumber3</ExciseTaxNumber>
  <VATID>VATID3</VATID>
  <Address>
  <Name>Name3</Name>
  <Street>Street3</Street>
  <HouseNumber>StreetNumber3</HouseNumber>
  <PostalCode>PostalCode3</PostalCode>
  <City>City3</City>
  <Language>CountryCodeISO3</Language>
  </Address>
  </ConsignorTrader>
  <PlaceOfDispatchTrader>
  <CustomerID>CustomerID4</CustomerID>
  <ExciseTaxNumber>ExciseTaxNumber4</ExciseTaxNumber>
  <VATID>VATID4</VATID>
  <Address>
  <Name>Name4</Name>
  <Street>Street4</Street>
  <HouseNumber>StreetNumber4</HouseNumber>
  <PostalCode>PostalCode4</PostalCode>
  <City>City4</City>
  <Language>CountryCodeISO4</Language>
  </Address>
  </PlaceOfDispatchTrader>
  <DispatchImportOffice>DispatchImportOffice1</DispatchImportOffice>
  <ConsigneeTrader>
  <CustomerID>CustomerID2</CustomerID>
  <ExciseTaxNumber>ExciseTaxNumber2</ExciseTaxNumber>
  <VATID>VATID2</VATID>
  <Address>
  <Name>Name2</Name>
  <Street>Street2</Street>
  <HouseNumber>StreetNumber2</HouseNumber>
  <PostalCode>PostalCode2</PostalCode>
  <City>City2</City>
  <Language>CountryCodeISO2</Language>
  </Address>
  </ConsigneeTrader>
  <ComplementConsigneeTrader>
  <MemberStateCode>MemberStateCode1</MemberStateCode>
  <CertificateOfExemption>CertificateOfExemption1</CertificateOfExemption>
  </ComplementConsigneeTrader>
  <DeliveryPlaceTrader>
  <CustomerID>CustomerID5</CustomerID>
  <ExciseTaxNumber>ExciseTaxNumber5</ExciseTaxNumber>
  <VATID>VATID5</VATID>
  <Address>
  <Name>Name5</Name>
  <Street>Street5</Street>
  <HouseNumber>StreetNumber5</HouseNumber>
  <PostalCode>PostalCode5</PostalCode>
  <City>City5</City>
  <Language>CountryCodeISO5</Language>
  </Address>
  </DeliveryPlaceTrader>
  <DeliveryPlaceCustomsOffice>DeliveryPlaceCustomsOffice1</DeliveryPlaceCustomsOffice>
  <EaadDraft>
  <InvoiceNumber>InvoiceNumber1</InvoiceNumber>
  <InvoiceDate>2000-01-02</InvoiceDate>
  <OriginTypeCode>OriginTypeCode1</OriginTypeCode>
  <DateOfDispatch>2000-01-01</DateOfDispatch>
  <TimeOfDispatch>12:00:00</TimeOfDispatch>
  <ImportSad>ImportSad1</ImportSad>
  <ImportSad>ImportSad2</ImportSad>
  </EaadDraft>
  <CompetentAuthorityDispatchOffice>CompetentAuthorityDispatchOffice1</CompetentAuthorityDispatchOffice>
  <MovementGuarantee>
  <GuarantorTypeCode>GuarantorTypeCode1</GuarantorTypeCode>
  <GuarantorTrader>
  <CustomerID>CustomerID1</CustomerID>
  <ExciseTaxNumber>ExciseTaxNumber1</ExciseTaxNumber>
  <VATID>VATID1</VATID>
  <Address>
  <Name>Name1</Name>
  <Street>Street1</Street>
  <HouseNumber>StreetNumber1</HouseNumber>
  <PostalCode>PostalCode1</PostalCode>
  <City>City1</City>
  <Language>CountryCodeISO1</Language>
  </Address>
  </GuarantorTrader>
  </MovementGuarantee>
  <HeaderEaad>
  <DestinationTypeCode>DestinationTypeCode1</DestinationTypeCode>
  <JourneyTime>JourneyTime1</JourneyTime>
  <TransportArrangement>TransportArrangement1</TransportArrangement>
  </HeaderEaad>
  <Transport>
  <TransportModeCode>TransportModeCode1</TransportModeCode>
  <ComplementaryInformation language="DE">test</ComplementaryInformation>
  </Transport>
  <TransportArrangerTrader>
  <CustomerID>CustomerID6</CustomerID>
  <ExciseTaxNumber>ExciseTaxNumber6</ExciseTaxNumber>
  <VATID>VATID6</VATID>
  <Address>
  <Name>Name6</Name>
  <Street>Street6</Street>
  <HouseNumber>StreetNumber6</HouseNumber>
  <PostalCode>PostalCode6</PostalCode>
  <City>City6</City>
  <Language>CountryCodeISO6</Language>
  </Address>
  </TransportArrangerTrader>
  <FirstTransporterTrader>
  <CustomerID>CustomerID7</CustomerID>
  <ExciseTaxNumber>ExciseTaxNumber7</ExciseTaxNumber>
  <VATID>VATID7</VATID>
  <Address>
  <Name>Name7</Name>
  <Street>Street7</Street>
  <HouseNumber>StreetNumber7</HouseNumber>
  <PostalCode>PostalCode7</PostalCode>
  <City>City7</City>
  <Language>CountryCodeISO7</Language>
  </Address>
  </FirstTransporterTrader>
  <TransportDetails>
  <TransportUnitCode>TransportUnitCode1</TransportUnitCode>
  <IdentityOfTransportUnits>IdentityOfTransportUnits1</IdentityOfTransportUnits>
  <CommercialSealIdentification>CommercialSealIdentification1</CommercialSealIdentification>
  <ComplementaryInformation language="DE">test</ComplementaryInformation>
  <SealInformation language="DE">test1</SealInformation>
  </TransportDetails>
  <TransportDetails>
  <TransportUnitCode>TransportUnitCode2</TransportUnitCode>
  <IdentityOfTransportUnits>IdentityOfTransportUnits2</IdentityOfTransportUnits>
  <CommercialSealIdentification>CommercialSealIdentification2</CommercialSealIdentification>
  <ComplementaryInformation language="DE">test</ComplementaryInformation>
  <SealInformation language="DE">test2</SealInformation>
  </TransportDetails>
  <BodyEaad>
  <BodyRecordUniqueReference>ItemNumber1</BodyRecordUniqueReference>
  <ExciseProductCode>ExciseProductCode1</ExciseProductCode>
  <CnCode>CnCode1</CnCode>
  <Quantity>Quantity1</Quantity>
  <GrossWeight>GrossWeight1</GrossWeight>
  <NetWeight>NetWeight1</NetWeight>
  <AlcoholicStrength>AlcoholicStrength1</AlcoholicStrength>
  <DegreePlato>DegreePlato1</DegreePlato>
  <FiscalMark language="DE">test</FiscalMark>
  <FiscalMarkUsedFlag>FiscalMarkUsedFlag1</FiscalMarkUsedFlag>
  <DesignationOfOrigin language="DE">test</DesignationOfOrigin>
  <SizeOfProducer>SizeOfProducer1</SizeOfProducer>
  <Density>Density1</Density>
  <CommercialDescription language="DE">test</CommercialDescription>
  <BrandNameOfProducts language="DE">test</BrandNameOfProducts>
  <Package>
  <KindOfPackages>KindOfPackages1</KindOfPackages>
  <NumberOfPackages>NumberOfPackages1</NumberOfPackages>
  <CommercialSealIdentification>CommercialSealIdentification3</CommercialSealIdentification>
  <SealInformation language="DE">test3</SealInformation>
  </Package>
  <Package>
  <KindOfPackages>KindOfPackages2</KindOfPackages>
  <NumberOfPackages>NumberOfPackages2</NumberOfPackages>
  <CommercialSealIdentification>CommercialSealIdentification4</CommercialSealIdentification>
  <SealInformation language="DE">test4</SealInformation>
  </Package>
  <WineProduct>
  <WineProductCategory>WineProductCategory1</WineProductCategory>
  <WineGrowingZoneCode>WineGrowingZoneCode1</WineGrowingZoneCode>
  <ThirdCountryOfOrigin>ThirdCountryOfOrigin1</ThirdCountryOfOrigin>
  <OtherInformation language="DE">test</OtherInformation>
  <WineOperation>WineOperationCode1</WineOperation>
  <WineOperation>WineOperationCode2</WineOperation>
  </WineProduct>
  </BodyEaad>
  <DocumentCertificate>
  <DocumentDescription language="AA">DocumentDescription1</DocumentDescription>
  <ReferenceOfDocument language="AA">ReferenceOfDocument1</ReferenceOfDocument>
  </DocumentCertificate>
  <DocumentCertificate>
  <DocumentDescription language="AA">DocumentDescription1</DocumentDescription>
  <ReferenceOfDocument language="AA">ReferenceOfDocument1</ReferenceOfDocument>
  </DocumentCertificate>
  </EMCSDeclaration>
  </EMCS>
  </Submit>
  </soap:Body>
  </soap:Envelope>